<a href="https://colab.research.google.com/github/GustavoAdolfoGuizaWalteros/Deep-Learning/blob/main/P1_T6_mercadeo_banacario.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [105]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

from sklearn import metrics 
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

df = pd.read_csv("https://raw.githubusercontent.com/luisFernandoCastellanosG/Machine_learning/master/Machine_Learning_Classic/Databasets/mercadeo_bancario.csv")
df.head(5)

   edad      trabajo estado_civil   ... anterior_contacto  numero_empleados si_no
0    44  blue-collar       married  ...                 0                88     0
1    53   technician       married  ...                 0                14     0
2    28   management        single  ...                 2              1993     1
3    39     services       married  ...                 0              1338     0
4    55      retired       married  ...                 1              1184     1

[5 rows x 19 columns]

In [106]:
df.shape # Columnas Filas

(41188, 19)

In [107]:
df.isnull().sum() # Verificar Valores nulos

edad                        0
trabajo                     0
estado_civil                0
educacion                   0
total_hijos                 0
credito_sin_pago            0
prestamo_vivienda           0
prestamo_personal           0
valor_prestamo              0
dias_ultimo_pago            0
tarjetas_credito            0
contacto                    0
mes                         0
dia_semana                  0
duracion_ultimo_contacto    0
dias_ultimo_contacto        0
anterior_contacto           0
numero_empleados            0
si_no                       0
dtype: int64

In [108]:
#Valores Unicos de cada Variables
print(sorted(df["trabajo"].unique()))
print(sorted(df["estado_civil "].unique()))
print(sorted(df["educacion"].unique()))
print(sorted(df["credito_sin_pago"].unique()))
print(sorted(df["prestamo_vivienda"].unique()))
print(sorted(df["prestamo_personal"].unique()))
print(sorted(df["contacto"].unique()))
print(sorted(df["mes"].unique()))
print(sorted(df["dia_semana"].unique()))

['admin.', 'blue-collar', 'entrepreneur', 'housemaid', 'management', 'retired', 'self-employed', 'services', 'student', 'technician', 'unemployed', 'unknown']
['divorced', 'married', 'single', 'unknown']
['Technological_school', 'illiterate', 'preschool', 'primary_school', 'professional.course', 'tecnical_school', 'university.degree', 'unknown']
['no', 'unknown', 'yes']
['no', 'unknown', 'yes']
['no', 'unknown', 'yes']
['cellular', 'telephone']
['apr', 'aug', 'dec', 'jul', 'jun', 'mar', 'may', 'nov', 'oct', 'sep']
['fri', 'mon', 'thu', 'tue', 'wed']

In [109]:
#Reem valor numerico
valorTrabajo = {"trabajo":{"admin.":1, "entrepreneur":2, "blue-collar":3, "housemaid":4, "management":5, "retired":6, "self-employed":7, 
                          "services":8, "student":9, "technician":10, "unemployed":11, "unknown":12}}
valorEstadoCivil = {"estado_civil ":{"unknown":1, "single":2, "married":3, "divorced":4}} 
valorEducacion = {"educacion":{"unknown":1, "illiterate":2, "preschool":3, "primary_school":4, "tecnical_school":5, 
                               "Technological_school":6, "university.degree":7, "professional.course":8}} 
valorCredSinPagar = {"credito_sin_pago":{"unknown":1, "yes":2, "no":3}} 
valorPrestVivienda = {"prestamo_vivienda":{"unknown":1, "yes":2, "no":3}}
valorPrestPersonal = {"prestamo_personal":{"unknown":1, "yes":2, "no":3}}
valorContacto = {"contacto":{"telephone":1, "cellular":2}}
valorMes = {"mes":{"mar":3, "apr":4, "may":5, "jun":6, "jul":7, "aug":8, "sep":9, "oct":10, "nov":11, "dec":12}}
valorDiasSemana = {"dia_semana":{"mon":1, "tue":2, "wed":3, "thu":4, "fri":5}}

In [110]:
#Reem DataFrame
df.replace(valorTrabajo, inplace=True)
df.replace(valorEstadoCivil, inplace=True)
df.replace(valorEducacion, inplace=True)
df.replace(valorCredSinPagar, inplace=True)
df.replace(valorPrestVivienda, inplace=True)
df.replace(valorPrestPersonal, inplace=True)
df.replace(valorContacto, inplace=True)
df.replace(valorMes, inplace=True)
df.replace(valorDiasSemana, inplace=True)

df.head(20)

    edad  trabajo  estado_civil   ...  anterior_contacto  numero_empleados  si_no
0     44        3              3  ...                  0                88      0
1     53       10              3  ...                  0                14      0
2     28        5              2  ...                  2              1993      1
3     39        8              3  ...                  0              1338      0
4     55        6              3  ...                  1              1184      1
5     30        5              4  ...                  0              1553      0
6     37        3              3  ...                  0               442      0
7     39        3              4  ...                  0               495      0
8     36        1              3  ...                  1              1097      1
9     27        3              2  ...                  1               414      0
10    34        4              2  ...                  0              1600      0
11    41        5              3  ...                  0              1630      0
12    55        5              3  ...                  0              1515      1
13    33        8              4  ...                  0               388      0
14    26        1              3  ...                  0               858      0
15    52        8              3  ...                  0              1342      0
16    35        8              3  ...                  0              1880      1
17    27        1              2  ...                  0              1972      1
18    28        3              3  ...                  0               308      0
19    26       11              2  ...                  0               286      0

[20 rows x 19 columns]